scratch/ideas/main.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-13 Sat 18:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project Ideas</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../scratch/bulma/css/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Project Ideas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org05a7437">List of Project Ideas</a>
<ul>
<li><a href="#org3fe470a">Calendar / Todo / Life Manager</a></li>
<li><a href="#org2210a07">Raffle Manager</a></li>
<li><a href="#orgb5a9c79">Embroidery Manager</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org05a7437" class="outline-2">
<h2 id="org05a7437">List of Project Ideas</h2>
<div class="outline-text-2" id="text-org05a7437">
</div>
<div id="outline-container-org3fe470a" class="outline-3">
<h3 id="org3fe470a">Calendar / Todo / Life Manager</h3>
<div class="outline-text-3" id="text-org3fe470a">
<ul class="org-ul">
<li>This pp can be on IOS, Android, Windows, and Mac</li>
<li>It will be a simple calendar that you can view yearly, monthly, weekly, daily, or by the hour</li>
<li>You'll be able to add events, goals, etc. on each day</li>
<li>You'll be able to add todo list for each day</li>
<li>You'll be able to add goals and dependencies to those goals
<ul class="org-ul">
<li>For example, in order to accomplish a goal you might need to complete another goal before or a set of tasks</li>
</ul></li>
<li>Based on these goals, tasks, and dependecies you can create a visual roadmap throughout the weeks, months, or years</li>
<li>In addition, you'll be able to set your scheule (like events)
<ul class="org-ul">
<li>For example at 6am I wake up, at 7am I need to clock in, at 12pm I take my lunch, 4pm I clock out, 5pm I run, 6pm I shower, 6:30pm I study, etc.</li>
</ul></li>
<li>Based on your schedule the app would notify you how much time you have left for that event
<ul class="org-ul">
<li>For example, you at 30 minutes left to study</li>
</ul></li>
<li>Also based on your schedule it can determine when do you need to go to work, go to the park and run</li>
<li>The app would try to recommend commute time, eating time, misc time to fit a schedule that can realistically be followed</li>
<li>The app would also notify you when you go over the time and create suggestions to reaccommodate your priorties</li>
<li>The app would even be able to create your own schedule (without the user doing it manually) based on user's priorities, todo items, events, and goals</li>
</ul>
</div>
</div>

<div id="outline-container-org2210a07" class="outline-3">
<h3 id="org2210a07">Raffle Manager</h3>
<div class="outline-text-3" id="text-org2210a07">
<ul class="org-ul">
<li>A web application where organizer can setup a raffle</li>
<li>The organizer would be able to share a link to their raffle</li>
<li>The organizer can have various options for the raffle such as limits, do they need a code, do they need to send accept requests and only if the organizer approves it do they get an entry, do they need to scan a QR code etc</li>
<li>The user can enter their information name and phone number / email</li>
<li>If the phone number is used then they will receive a text with their confirmed entry and their status link with the raffle information such as when will the winner be drawn, where (if applicable, e.g. a location or link), the amount of total entries, how many entries do they have, and the user's information</li>
<li>If they enter an email then it will be sent to their email instead of text</li>
<li>The user id would be the phone number or email so if a phone number appears multiple times as entries it will be linked to the same user</li>
<li>The organizer would be able to easily draw a winner</li>
<li>The organizer would be able to livestream the event and share a link to the livestream</li>
<li>The raffle application would have animations (such as a triangle with "balls" dropping down similar to Stake), or "balls" rolling in a sphere, etc</li>
<li>The organizer would have the option to draw directly a winner or have a "elimination" game
<ul class="org-ul">
<li>For example, it will eliminate half, then half, until there is 5 players left, and then draw a winner from there</li>
</ul></li>
<li>Each entry can be represented as a sphere, ticket, car, character, player, etc.</li>
<li>We need to show that if a user has 5 entries then 5 entries are present</li>
</ul>
</div>
</div>

<div id="outline-container-orgb5a9c79" class="outline-3">
<h3 id="orgb5a9c79">Embroidery Manager</h3>
<div class="outline-text-3" id="text-orgb5a9c79">
<ul class="org-ul">
<li>A web application that is simple</li>
<li>It asks the organizer to sign-in first and select their location (so I can know where to send it to)</li>
<li>Then whenever a customer wants to do a name, the organzier can use their own tablet or they send them a organizer-specific link</li>
<li>The link will display the wait time, ask for their phone number, the name they want to type, font, and color</li>
<li>It will dynamically show them a preview and confirm everything is correct</li>
<li>They may be requirements if the name is too long for the font or the character is not shown for the font etc</li>
<li>The request will be sent to the organizer and the embroider operator</li>
<li>The organizer and embroider operator can always cancel orders on their end and can notify the customer</li>
<li>Specific information can be requested to the customer such as a different color, name, or font if necessary by sending them a text</li>
<li>The embroider operator would click on the orders as they are working on them to indicate it is in-progress</li>
<li>Once it is finished the operator can indicate it is finished and give it to the organizer</li>
<li>The organizer can indicate it is finished and it will send a text to the customer</li>
<li>The customer can always check their waittime and position in the queue with the link sent when they register</li>
<li>The app would be able to calculate the time to pick-up, deliver, position in queue, and to embroider to give an accurate waittime</li>
<li>In addition to this, it would be cool to create an app that automatically create these names into DST files and sends them to the embroidery machine (this way we skip having to create the DST names ourselves and it is automated)
<ul class="org-ul">
<li>This would be a litte harder but I think definitely doable</li>
<li>So as the customer sends the request the machine would already know the font and the size to create a DST file and send it to the machine so the operator can just embroider and not have to create the DST file as well</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
